---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceMoveBaseWithGrids
source: html/75a398d8-700a-317e-9417-e7cd7c73022b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceMoveBaseWithGrids Property

"Move Base With Grids"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceMoveBaseWithGrids { get; }
```